#include <iostream>
#include <Windows.h>
#include <cmath>
#include <string>

using namespace std;
 
/*
Варіант 16
1. Визначити КЛАС «КАНДИДАТ», з наступними полями:
 ПІБ;
 дату народження;
 партія, членом якої вважає себа;
 індекс популярності.
Створити наступні функції-члени класу:  
конструктори(які вважаєте необхідними, пояснити свій вибір); 
методи доступу до закритих полів; метод(и), який(і) допомагають реалізувати запит, описаний у пункті №2;   
деструктор (за необхідністю).
2. Створити 10 об’єктів типу «КАНДИДАТ».  Вивести на екран інформацію про партії, 
які балотують свої депутатів на виборах ї загальну інформацію про трьох найпопулярніших кандидатів.
*/
//класс об'єкта
class Candidate
{ 
public:
    //Конструктор в який передається рейтинг кандидата
    Candidate(float index) 
    {
        this->index = index;
    }
    //сеттер для введення даних, передача параметрів кандидата 
    void set(string name, string data, string party)
    {
       candidat =  "ПІБ " + name + "; дату народження " + data + "; партія, членом якої вважає себа " + party + "; індекс популярності ";
    }
    //геттер для отримання даних
    void get(){
      std::cout << candidat << index << ".\n" << std::endl;
    }
    //Деструктор об'єкта кандидат
    ~Candidate() {
		std::cout << "видаляємо кандидата " << index << std::endl;
	  }
      // закриті для доступу величини
private:
    string candidat;
    string name; 
    string data; 
    string party; 
    float index;
};
int main()
{
  SetConsoleCP(CP_UTF8);
   SetConsoleOutputCP(CP_UTF8);
  const int rows = 10;
    const int cols = 3;
	string candidates[rows][cols] = {{"Ситник Олександр Олександрович", "28.12.1985", "зелених"},
  {"Міна Марія Олександрівна", "26.7.1966", "червоних"},
  {"Шумков Антон Павлович", "11.06.1977", "синіх"},
  {"Якуба Віктор Миколайович", "12.03.1981", "фіолетових"},
  {"Ямщикова Маргарита Олександрівна", "03.10.1975", "білих"},
  {"Берестовська Марія В'ячеславівна", "02.08.1967", "блакитних"},
  {"Кошулько Ярослав Олександрович", "15.08.1979", "жовтих"},
  {"Ромашко Аделіна Романівна ", "25.10.1981", "оранжевих"},
  {"Шилов Ігор Юрійочич", "24.3.1974", "коричневих"},
  {"Марченко Анна Вікторівна", "24.3.1961", "чорних"}  }; 
  
	//Найвищий можливий рейтинг кандидата 75
  float index_c[rows] = {2, 75, 3, 55, 64, 17, 7, 12, 11, 8}; 

  int size = sizeof(candidates)/sizeof(candidates[0]);
  std::cout << "рейтингові кандитати" << std::endl;
   for(int i=0; i < size; i++){
    float index = index_c[i];
    //Визначення кандидатів з найбільшим рейтингом
    if(index >= 55 && index <= 75 ){
    //Створення об'єкту кандидат
    Candidate candidat_out(index);
    //Передача параметра об'єкт кандидат
    candidat_out.set(candidates[i][0], candidates[i][1], candidates[i][2]);    
    //Отримання об'єкту кандидат, виведення даних
    candidat_out.get();
    }
  }
}